# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

num = int(input("Введите число: "))

# print("{0:#b}".format(num)) -1 способ
# print(bin(num)) - 2 способ


def dec_to_bin(x):  # - 3 способ
    return int(bin(x)[2:])


print(dec_to_bin(num))
